# 25. Class(클래스 : 객체)

# 1. 함수와 변수명들의 모든 집합체를 의미
# 2. 클래스를 선언시 객체를 만들어서 자동으로 클래스를 사용

# 객체(Object)란? 물리적, 추상적으로 표현 할 수 있는 모든 대상들이 다 객체가 됨.

# 25_1) 클래스와 객체의 의미

# 예시 : 햄버거로 따지면, 햄버거를 만드는 레시피가 클래스
# 즉, 클래스는 객체(햄버거)를 만들기 위한 틀

# 그러면, 행버거를 만들기 위한 재료들이 필요 : 빵, 패티, 양상추 등등
# 이 재료들이 함수나 변수명들로 구성이 됨.
# 클래스 안에 정의된 함수들은 "매서드" 라고 부릅니다.
# 클래스 안에 선언된 변수명들 (또는 메서드 안에 들어간 변수명)은 "멤버 변수"
# "메서드", "멤버 변수" 는 클래스 안에서만 존재하는 용어

# 25_2) 문법
# 1) 클래스 정의
# class 클래스명
#     def 메서드명(매개변수1, .....)
#         기능들 
#         멤버변수들...(지역변수)
#     멤버변수들
#     ...

# 2) 객체 생성
# 객체이름(변수명) = 클래스명()
# 객체이름.메서드명(인수1, ....)
# 객체이름.멤버변수







