# day01_01.py
# <파이썬 기초 문법>
# Ctrl + Alt + N
# 1. print() : 출력하는 함수

# 1_1) 문자 및 문자열 표기 : " ~ " 나 ' ~ ' 는 한 줄 문자열 표기입니다.

print("a")
print('A')
print("Hello Python!!!")
print('hello python!')

## print(a)     #Error : 글자들은 반드시 문자열이란 표기가 필요

print("123")     # 숫자 123이 아닌 글자 일이삼
print(123 + 1)   # 숫자(정수) 123입니다. 
print(1.23)      # 숫자(실수) 1.23입니다.

# 1_2) 여러 줄 문자열 표기: """ ~ """ 나 ''' ~ '''
## print("hello
## python")             #Error : " ~ "는 한 줄만...

print("""hello
python
!!! """)

# 1_3) 주석 : 프로그램이 인식하지 x 

# 은 한 줄 주석

''' 여러
줄 주석은
여러 줄
문자열로 편법이용 ''' 

#팁 (비주얼 스튜디오 코드의 주석 커맨드)
# Ctrl + / 로 주석 처리 및 해제

